/** Коды ошибок
 *
 * `-3` - Неизвестная ошибка в работе API, при её возникновении нужно сообщить куда-нибудь.
 * 
 * `-2` - Внутренняя ошибка сервера. О ней тоже нужно куда-нибудь сообщить.
 * 
 * `-1` - По адресу, который вы указали, не нашлось ни одного метода.
 * 
 * `1` - Указан неправильный токен. Вы можете получить его командой `/api dev` на сервере MiniGames.
 * 
 * `2` - Исчерпано количество запросов в минуту.
 * 
 * `3` - Один из заданных параметров не передан или указан неправильно. Чтобы решить ошибку, почитайте описание метода и его параметров.
 * 
 * `4` - Метод отключен или не работает по каким-то причинам.
 * 
 * `10+` - Ошибки с кодом 10+ указывают на то что запрошенный “ресурс” не существует, например: игрок, гильдия, матч.
 */
export type ErrorCodes = -3 | -2 | -1 | 1 | 2 | 3 | 4 | 10 | number;

/** Тип ошибок, возвращаемых из API */
export interface IError {
  error: {
    error_code: ErrorCodes;
    error_msg: string;
    comment?: string;
  };
}
